Hola Lisseth, sabes como empiezo a escribirte esto? Al recordar los viajes que nos dimos juntos, muy aparte de todo lo que hablamos y en la situacion que estaba, me agrado mucho tu compañia y sabes? Te extraño mucho, es raro, pero extraño dormir contigo, algo siempre me llama a ti, y cuanto daria para sacarme la espina, pero sabes? Tenia miedo no se por qué, te veia y me daba la inquietud de que podia pasar y como ibas a reaccionar, hubiera tenido esa fortaleza que tuve cuando me declaré jaja, pero bueno, se que no he llegado a tu vida en un buen momento para mi ni para ti, pero sabes? No me quiero arrepentir de nunca haberlo hecho, y siempre te considero alguien muy importante y especial en mi vida.

Te comento que mi relacion ya no da para mas, pense que estaba enamorado, pero todo esto que primeramente le hice y me hizo daño siempre llega a un punto en que aparece y mata lentamente el amor que deberia tenerla, yo al regresar he tenido muchos problemas fuertes nuevamente, y ahi le estoy dando, hasta me comprometí pero no se por que lo hice, muy en el fondo creo fue por cumplir expectativas y no quiero vivir una vida entera asi, lucho por eso por que digo que me paso?. Pero tengo que ser sincero con alguien, y quiero serlo contigo, tu a mi me entiendes y no me hace falta dar tanta explicación, pero no me juzgues por favor esto es lo que me esta pasando, y, claro que hubo un tiempo de calma, pero bueno esta ya es mi última oportunidad y solo queda poco la verdad para terminarla y esto viene de los 2, quiero hacer mi vida y disfrutar. Esto de juntarme con alguien aun no es lo mio, pero lo que si quiero mas en mi vida es tener una aventura contigo,  y espero puedas aceptarme e irnos a disfrutar la vida, no se por que quiero, pero quiero que estes tu en esto. Solo tu! Quiero que este mensaje lo guardes con lo mas preciado que tengas y quede entre los 2 , yo se que me entiendes y se que lo haras, la ultima pregunta que me hiciste de que como te consideraba? La respuesta no fue 100 sincera, yo te queria decir otra cosa mas y no me quiero arrepentir si es que por a o b la vida no me lo permita decirte. Pero eso te lo dire en persona. 

 Ahh y disculpame y perdoname por haberme alejado de ti, en realidad no lo quise hacer, pero ya sabes fue una obligación y no una realidad. Espero verte muy pronto mi crespita, y disfrutar de muchas cosas juntos.

Respondeme este mensaje y dejame tu numero de celular, ahorita mi cabeza piensa en esto y cuanto quisera verte pero tengo que tener calma, por que quiza todo esto que te diga para ti no signifique nada y lo entenderé. 
